mrcodetastic/MBI5153-DMG1075-MatrixPanel-DMA/esp-idf_mbi5153_esp32s2_24bit_i2s_lcd_dma/main/esp32s2_i2s_lcd_24bit_parallel_dma.cpp
    esp_err_t i2s_lcd_mode_setup() // The big one that gets everything setup.
    {
      esp_err_t ret = ESP_OK;

        // START: CONFIGURATION
        config_t _cfg;


        _cfg.bus_freq = 6*1000*1000; // Do not go above 6Mhz
        _cfg.parallel_width = 24;

        _cfg.pin_wr      = MBI_DCLK_PIN; // lcd clock
        _cfg.invert_pclk = false;

        // Ensure this order matches that of the struct from lsb to msb.

        _cfg.pin_d0  = ADDR_A_PIN; 
        _cfg.pin_d1  = ADDR_B_PIN; 
        _cfg.pin_d2  = ADDR_C_PIN; 
        _cfg.pin_d3  = ADDR_D_PIN; 
        _cfg.pin_d4  = ADDR_E_PIN; 
        _cfg.pin_d5  = -1; 
        _cfg.pin_d6  = MBI_LAT_PIN;
        _cfg.pin_d7  = MBI_GCLK_PIN;
        _cfg.pin_d8  = MBI_R1_PIN;  // start of second byte
        _cfg.pin_d9  = MBI_G1_PIN;
        _cfg.pin_d10 = MBI_B1_PIN;
        _cfg.pin_d11 = MBI_R2_PIN;
        _cfg.pin_d12 = MBI_G2_PIN;  
        _cfg.pin_d13 = MBI_B2_PIN; 
        _cfg.pin_d14 = -1;  
        _cfg.pin_d15 = -1; // end of byte 2
        _cfg.pin_d16 = MBI_R3_PIN; // start of third byte
        _cfg.pin_d17 = MBI_G3_PIN;
        _cfg.pin_d18 = MBI_B3_PIN;
        _cfg.pin_d19 = MBI_R4_PIN;
        _cfg.pin_d20 = MBI_G4_PIN;      
        _cfg.pin_d21 = MBI_B4_PIN;        
        _cfg.pin_d22 = -1;          
        _cfg.pin_d23 = DEBUG_PIN;  // end of third byte

        // END CONFIGURATION
              
        auto dev = getDev();
        volatile int iomux_signal_base;
        volatile int iomux_clock;
       // int irq_source;

        periph_module_reset(PERIPH_I2S0_MODULE);
        periph_module_enable(PERIPH_I2S0_MODULE);

        iomux_clock = I2S0O_WS_OUT_IDX;
        //irq_source = ETS_I2S0_INTR_SOURCE;

        if ( _cfg.parallel_width == 24)
        {
          ESP_LOGI(TAG, "Configuring signal base for 24bit");
          iomux_signal_base = I2S0O_DATA_OUT0_IDX;

        } else {

          ESP_LOGI(TAG, "Configuring signal base for 16bit");
          iomux_signal_base = I2S0O_DATA_OUT8_IDX;
        }

        // Setup GPIOs
        int bus_width = _cfg.parallel_width;

        // Clock output GPIO setup
        _gpio_pin_init(_cfg.pin_wr); // clock

        // Data output GPIO setup
        int8_t* pins = _cfg.pin_data;  

        for(int i = 0; i < bus_width; i++)  {
        _gpio_pin_init(pins[i]);
        }

        // Route clock signal to clock pin (can route to two pins if we want)
        gpio_matrix_out(_cfg.pin_wr, iomux_clock, _cfg.invert_pclk, 0); // inverst clock if required

        // Route data pins
        for (size_t i = 0; i < bus_width; i++) {
          if (pins[i] >= 0) {
            gpio_matrix_out(pins[i], iomux_signal_base + i, false, false);
          }
        }

        ////////////////////////////// Clock configuration //////////////////////////////
        // Code borrowed from: https://github.com/espressif/esp-iot-solution/blob/master/components/bus/i2s_lcd_esp32s2_driver.c
        //unsigned int _div_num = (unsigned int) (160000000L / _cfg.bus_freq / i2s_parallel_get_memory_width(ESP32_I2S_DEVICE, bus_width));       

        // Configure the clock
        dev->clkm_conf.val = 0;
        
#ifdef USE_PSRAM
        dev->clkm_conf.clkm_div_num = (160/5); // Effectively 1.2Mhz
#else
        dev->clkm_conf.clkm_div_num = 7; // 160/7/3bytes = 5mhz
#endif        
                
        ESP_LOGD(TAG, "I2S clock divider (clkm_div_num) is: %d", (dev->clkm_conf.clkm_div_num));

#ifndef USE_PSRAM        
        int effective_frequency = (160 / dev->clkm_conf.clkm_div_num) / i2s_parallel_get_memory_width(24);
        ESP_LOGD(TAG, "I2S effective output frequency is: %d Mhz", effective_frequency);        
#endif 

        dev->clkm_conf.clkm_div_b = 0;
        dev->clkm_conf.clkm_div_a = 63;
        dev->clkm_conf.clk_sel = 2;
        dev->clkm_conf.clk_en = 1;

        // Configure sampling rate
        //dev->sample_rate_conf.tx_bck_div_num = 40000000 / 2000000; // Fws = Fbck / 2

        /* ESP32-S2 TRM IS CLEAR: Note that I2S_TX_BCK_DIV_NUM[5:0] must not be configured as 1.*/
        dev->sample_rate_conf.tx_bck_div_num = 2; 

        dev->sample_rate_conf.tx_bits_mod = _cfg.parallel_width;

        dev->timing.val = 0;

        dev->int_ena.val = 0;
        dev->int_clr.val = ~0;

        dev->conf2.val = 0;
        dev->conf2.lcd_en = 1;

        // Configuration data format
        dev->conf.val = 0;
      // dev->conf.tx_right_first = 1; // doesn't change anything if 0
      // dev->conf.tx_msb_right = 1;   // doesn't change anything if 0
        dev->conf.tx_dma_equal = 1;

        dev->conf1.tx_pcm_bypass = 1;
        dev->conf1.tx_stop_en = 1;

        dev->fifo_conf.val = 0;
        dev->fifo_conf.tx_data_num = 32;
        dev->fifo_conf.dscr_en = 1;    

        // Not requried for S2?
        dev->fifo_conf.tx_fifo_mod_force_en = 1;       
        dev->fifo_conf.tx_fifo_mod = 1;   // frequenc
        dev->conf_chan.tx_chan_mod = 0;//remove


        dev->lc_conf.ext_mem_bk_size = 0;
        dev->fifo_conf.tx_24msb_en = 0;

        //dev->int_ena.out_done = 1;
        //dev->int_ena.out_eof  = 1; // no use for this. No implementation works which is of use.

        // Setup I2S Interrupt
        //SET_PERI_REG_BITS(I2S_INT_ENA_REG(I2S_NUM_0), I2S_OUT_EOF_INT_ENA_V, 1, I2S_OUT_EOF_INT_ENA_S);

        // Allocate a level 1 intterupt: lowest priority, as ISR isn't urgent and may take a long time to complete
        // ret = esp_intr_alloc(irq_source, (int)(ESP_INTR_FLAG_IRAM | ESP_INTR_FLAG_LEVEL1), i2s_dma_isr, NULL, NULL);
      
        return ret;
      }

    esp_err_t i2s_dma_buff_allocate()
    {

        // Allocate the buffer for new greyscale data, at the same time as sending out gclks,
        // and finishing off with a vsync.
        {
          size_t alloc_size_bytes  = (TOTAL_SIZE+BUFF_BITLEN_VSYNC) * sizeof(DMA_DATA_TYPE); // Up to 44,000  pulses of 24 bits in parallel.
          size_t actual_size = 0;

#ifdef USE_PSRAM
          ESP_LOGI(TAG, "Allocating PSRAM DMA memory for global_buffer_gclk_cdata.");  
          esp_err_t err = esp_dma_malloc(alloc_size_bytes, ESP_DMA_MALLOC_FLAG_PSRAM, (void **) &global_buffer_gclk_cdata, &actual_size);
          assert(err == ESP_OK);
#else
          ESP_LOGI(TAG, "Allocating SRAM DMA memory for global_buffer_gclk_cdata.");  
          global_buffer_gclk_cdata = static_cast<DMA_DATA_TYPE *>(heap_caps_malloc(alloc_size_bytes, MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA));
          assert(global_buffer_gclk_cdata != nullptr);

