mrcodetastic/MBI5153-DMG1075-MatrixPanel-DMA/esp-idf_mbi5153_esp32s2_24bit_i2s_lcd_dma/main/esp32s2_i2s_lcd_24bit_parallel_dma.cpp
              _mbi_load_config_reg1(start_pos);
              ESP_LOGI(TAG, "5. Start Pos is: %d.", start_pos);      

              // Stay low for a bit
              _mbl_set_latch_for_config_buff(2, start_pos, true); // stay low
              ESP_LOGI(TAG, "5a. Start Pos is: %d.", start_pos);                  

              _mbl_set_latch_for_config_buff(10, start_pos); // reset
              ESP_LOGI(TAG, "6. Start Pos is: %d.", start_pos);                                    

              // 
              //     // Send preactive - 14 clocks of dclock rising edge
              //     _mbl_set_latch_for_config_buff(14, start_pos); // stay low
              //     ESP_LOGI(TAG, "6. Start Pos is: %d.", start_pos);                          

              //     // Stay low for a bit
              //     _mbl_set_latch_for_config_buff(2, start_pos, true); // stay low
              //     ESP_LOGI(TAG, "7. Start Pos is: %d.", start_pos);                          

              //     _mbi_load_config_reg1(start_pos);
              //     ESP_LOGI(TAG, "8. Start Pos is: %d.", start_pos);                          
              // 
        } // start-up


      // Load just GCLK data
      return ESP_OK;
    }    

    esp_err_t mbi_send_config()
    {
      auto dev = getDev();

      // Configure DMA burst mode
      dev->lc_conf.val = I2S_OUT_DATA_BURST_EN | I2S_OUTDSCR_BURST_EN;
     

      while (!dev->state.tx_idle);
      dev->conf.tx_start = 0;
      dev->conf.tx_reset = 1;
      dev->conf.tx_reset = 0;
      dev->conf.tx_fifo_reset = 1;
      dev->conf.tx_fifo_reset = 0;

      // ensure to link to the dma_ll var!!
      dev->out_link.addr = ((uint32_t)&dma_ll_configuration[0]) & 0xfffff;
      dev->out_link.start = 1;
      ets_delay_us(1);
      dev->conf.tx_start = 1;

      return ESP_OK;

    } // end 

    esp_err_t mbi_start_output_loop()
    {
      auto dev = getDev();

      // Configure DMA burst mode
      dev->lc_conf.val = I2S_OUT_DATA_BURST_EN | I2S_OUTDSCR_BURST_EN;      

      while (!dev->state.tx_idle);
      dev->conf.tx_start = 0;
      dev->conf.tx_reset = 1;
      dev->conf.tx_reset = 0;
      dev->conf.tx_fifo_reset = 1;
      dev->conf.tx_fifo_reset = 0;

      // ensure to link to the dma_ll var!!
      dev->out_link.addr = ((uint32_t)&dma_ll_gclk_cdata[0]) & 0xfffff; // ((uint32_t)&frames[0].dma[0]) & 0xfffff; // always frame 0
      dev->out_link.start = 1;
      ets_delay_us(1);
      dev->conf.tx_start = 1;

      return ESP_OK;

    } // end 

    void mbi_clear()
    {
        // Iterate only for length of greyscale data bitlength.
        for (int i = 0; i< TOTAL_SIZE; i++) { 

          global_buffer_gclk_cdata[i].byte1 = 0; 
          global_buffer_gclk_cdata[i].byte2 = 0; 

          // if we use PSRAM need to add that cache writeback bullshite here.
          // PSRAM on S2 sucks ballz so not going to bother.
        }
    }

    IRAM_ATTR void mbi_set_pixel(uint8_t x, uint8_t y, uint8_t r_data, uint8_t g_data, uint8_t b_data) {

        if (x >= PANEL_PHY_RES_X || y >= PANEL_PHY_RES_Y) {
            return;
        }

        x += 2;

        int y_normalised = y % PANEL_SCAN_LINES;
        int bit_start_pos = (1280 * y_normalised) + ((x % 16) * 80) + ((x / 16) * 16);
        int rgb_channel = (y / PANEL_SCAN_LINES);

        uint8_t mask;

      /*
        MBI5153 provides a selectable 14-bit or 13-bit gray scale by setting the configuration register1 bit [7]. The default 
        value is set to ’0’ for 14-bit color depth. In 14-bit gray scale mode, users should still send 16-bit data with 2-bit ‘0’ in 
        LSB bits. For example, {14’h1234, 2’h0}. 

        RGB colour data provided is only 8bits, so we'll fill it from bit 16 down to bit 8
      */    
        for (int subpixel_colour_bit = 7; subpixel_colour_bit >= 0; --subpixel_colour_bit) {
            mask = 1 << subpixel_colour_bit;
            switch (rgb_channel) {
                case 0:
                    global_buffer_gclk_cdata[bit_start_pos].r1 = (mask & r_data) ? 1 : 0;
                    global_buffer_gclk_cdata[bit_start_pos].g1 = (mask & g_data) ? 1 : 0;
                    global_buffer_gclk_cdata[bit_start_pos].b1 = (mask & b_data) ? 1 : 0;
                    break;
                case 1:
                    global_buffer_gclk_cdata[bit_start_pos].r2 = (mask & r_data) ? 1 : 0;
                    global_buffer_gclk_cdata[bit_start_pos].g2 = (mask & g_data) ? 1 : 0;
                    global_buffer_gclk_cdata[bit_start_pos].b2 = (mask & b_data) ? 1 : 0;
                    break;
                case 2:
                    global_buffer_gclk_cdata[bit_start_pos].r3 = (mask & r_data) ? 1 : 0;
                    global_buffer_gclk_cdata[bit_start_pos].g3 = (mask & g_data) ? 1 : 0;
                    global_buffer_gclk_cdata[bit_start_pos].b3 = (mask & b_data) ? 1 : 0;
                    break;
                case 3:
                    global_buffer_gclk_cdata[bit_start_pos].r4 = (mask & r_data) ? 1 : 0;
                    global_buffer_gclk_cdata[bit_start_pos].g4 = (mask & g_data) ? 1 : 0;
                    global_buffer_gclk_cdata[bit_start_pos].b4 = (mask & b_data) ? 1 : 0;
                    break;
            }
            bit_start_pos++;
        }

        #ifdef USE_PSRAM
            Cache_WriteBack_Addr((uint32_t)pixel, sizeof(PixelData) * 8);
        #endif
    }


    void mbi_update()
    {
        // Do nothing as vsync is permanently on 

    }

    // Do it all
    esp_err_t mbi_start()
    {
        ESP_ERROR_CHECK(i2s_lcd_mode_setup());

        i2s_dma_buff_allocate();
        mbi_load_inital_dma_data();
        mbi_send_config();
        mbi_start_output_loop();        

        return ESP_OK;
    }


